#### This is a follow along notebook insiperd by:
https://medium.com/dunder-data/minimally-sufficient-pandas-a8e67f2a2428

### How to best use the Pandas library for data analysis

In [1]:
import pandas as pd

### Selecting a single column of data

In [ ]:
df = pd.read_csv('intro_to_pandas/data/sample_data.csv', index_col=0)

In [6]:
df

          state  color    food  age  height  score
name
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

#### Selection with brackets

In [7]:
df['state']

name
Jane         NY
Niko         TX
Aaron        FL
Penelope     AL
Dean         AK
Christina    TX
Cornelia     TX
Name: state, dtype: object

#### Selection with dot notation

In [8]:
df.state

name
Jane         NY
Niko         TX
Aaron        FL
Penelope     AL
Dean         AK
Christina    TX
Cornelia     TX
Name: state, dtype: object

#### Issues with the dot notation
There are three issues with using dot notation. It doesn’t work in the following situations:
 - When there are spaces in the column name ( e.g. If the desired column name  is `favorite food` you can only use df['favorite food'])
 - When the column name is the same as a DataFrame method (when a column name and a DataFrame method collide, Pandas will always reference the method and not the column name. For instance, for the column name `count` you must use df['count'])
 - When the column name is a variable (Let’s say you are using a variable to hold a reference to the column name you would like to select. In this case, the only possibility again is to use the brackets: we assign the value of a column name to a variable and then pass this variable to the brackets)

#### The brackets are a superset of dot notation
The brackets are a strict superset of the dot notation in terms of functionality for selecting a single column.

**Guidance**: Use the brackets for selecting a column of data

### The deprecated `ix` indexer - never use it

Pandas allows you to select rows by either label or integer location. This flexible dual selection capability is a great cause of confusion for beginners. The `ix` indexer was created in the early days of Pandas to select rows and columns by both label and integer location. This turned out to be quite ambiguous as Pandas row and column names can be both integers and strings.
To make selections explicit, the `loc` and `iloc` indexers were made available. The `loc` indexer selects only by label while the `iloc` indexer selects only by integer location. 

Although the `ix` indexer was versatile, it has been deprecated in favor of the `loc` and `iloc` indexers.

**Guidance**: Every trace of `ix` should be removed and replaced with `loc` or `iloc`

### Selection with `at` and `iat`

Two additional indexers, `at` and `iat`, exist that select a single cell of a DataFrame. 

These provide a slight performance advantage over their analogous loc and ilocindexers. But, they introduce the additional burden of having to remember what they do. Also, for most data analyses, the increase in performance isn’t useful unless it’s being done at scale. 

And if performance truly is an issue, then taking your data out of a DataFrame and into a `NumPy` array will give you a large performance gain.

### Performance comparison `iloc` vs `iat` vs `NumPy`

Let’s compare the perfomance of selecting a single cell with `iloc`, `iat` and a `NumPy` array. Here we create a NumPy array with 100k rows and 5 columns containing random data. We then create a DataFrame out of it and make the selections.

In [27]:
import numpy as np

In [36]:
a = np.random.rand(10 ** 5, 5)
df1 = pd.DataFrame(a)
row = 50000
col = 3

In [37]:
df1

              0         1         2         3         4
0      0.097876  0.308251  0.228530  0.323384  0.873424
1      0.937836  0.195134  0.012754  0.912397  0.330972
2      0.534747  0.394239  0.211902  0.277955  0.753146
3      0.381974  0.852967  0.155725  0.316403  0.257421
4      0.982048  0.642830  0.851614  0.016074  0.594194
...         ...       ...       ...       ...       ...
99995  0.594785  0.624065  0.131268  0.599858  0.840899
99996  0.565726  0.903186  0.048040  0.330047  0.853389
99997  0.840162  0.378138  0.736107  0.351536  0.993785
99998  0.831537  0.893974  0.683433  0.970019  0.009108
99999  0.541667  0.999122  0.019455  0.093132  0.685377

[100000 rows x 5 columns]

In [38]:
%timeit df1.iloc[row, col]

26.9 µs ± 2.59 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [39]:
%timeit df1.iat[row, col]

24.9 µs ± 1.58 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [40]:
%timeit a[row, col]

251 ns ± 18.3 ns per loop (mean ± std. dev. of 7 runs, 1000000 loops each)

**Guidance: Use NumPy arrays if your application relies on performance for selecting a single cell of data and not `at` or `iat`**

### Method Duplication

#### `read_csv` vs `read_table` duplication


One example of duplication is with the `read_csv` and `read_table` functions. They both do the same exact thing, read in data from a text file. 
The only difference is that `read_csv` defaults the delimiter to a comma, while `read_table` uses tab as its default.

In [43]:
college = pd.read_csv('intro_to_pandas/data/college.csv')
college.head()

,instnm,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,...,ugds_2mor,ugds_nra,ugds_unkn,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
3,University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
4,Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [51]:
college2 = pd.read_table('intro_to_pandas/data/college.csv', delimiter=',')
college2.head()

,instnm,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,...,ugds_2mor,ugds_nra,ugds_unkn,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
3,University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
4,Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [52]:
college.equals(college2)

True

The `read_table` function is getting deprecated and should never be used.

**Guidance: Only use `read_csv` to read in delimitted text files**


#### `isna` vs `isnull` and `notna` vs `notnull`


The `isna` and `isnull` methods both determine whether each value in the DataFrame is missing or not. 
The result will always be a DataFrame (or Series) of all boolean values.

`notna` and `notnull` are aliases of each other as well and simply return the opposite of `isna`. 
There's no need for both of them

In [54]:
college_isna = college.isna()
college_isnull = college.isnull()
college_isna.equals(college_isnull)

True

You cab use the methods that end in na to match the names of the other missing value methods `dropna` and `fillna`.
You can also avoid ever using `notna` since Pandas provides the inversion operator, `~` to invert boolean DataFrames.

### Arithmetic and Comparison Operators and their Corresponding Methods

**Guidance: Only use the arithmetic and comparison methods when absolutely necessary, otherwise use the operators**

The arithmetic and comparison operators are more common and should be attempted first. If you come across a case where the operator does not complete the task, then use the method.

### Builtin Python functions vs Pandas methods with the same name

There are a few DataFrame/Series methods that return the same result as a builtin Python function with the same name. They are:
`sum`
`min`
`max`
`abs`

In [55]:
ugds = college['ugds'].dropna()

In [56]:
ugds.head()

0     4206.0
1    11383.0
2      291.0
3     5451.0
4     4811.0
Name: ugds, dtype: float64

In [57]:
sum(ugds)

16200904.0

In [58]:
ugds.sum()

16200904.0

In [59]:
max(ugds)

151558.0

In [60]:
ugds.max()

151558.0

In [61]:
min(ugds)

0.0

In [62]:
ugds.min()

0.0

In [63]:
abs(ugds).head()

0     4206.0
1    11383.0
2      291.0
3     5451.0
4     4811.0
Name: ugds, dtype: float64

In [64]:
ugds.abs().head()

0     4206.0
1    11383.0
2      291.0
3     5451.0
4     4811.0
Name: ugds, dtype: float64

In [65]:
%timeit sum(ugds)

650 µs ± 31.4 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [66]:
%timeit ugds.sum()

89.8 µs ± 7.63 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

Calling sum(ugds) essentially creates a Python for loop to iterate through each value one at a time. On the other hand, calling ugds.sum() executes the internal Pandas sum method which is written in C and much faster than iterating with a Python for loop.
There is a lot of overhead in Pandas which is why the difference is not greater. If we instead create a NumPy array and redo the timings, we can see an enormous difference with the Numpy array sum outperforming the Python sum function by a factor of 200 on an array of 10,000 floats.

**Guidance: Use the Pandas method over any built-in Python function with the same name.**

### Standardizing groupby Aggregation


The three components of groupby aggregation
Typically, when calling the groupby method, you will be performing an aggregation. This is the by far the most common scenario. 

When you are performing an aggregation during a groupby, there will always be three components.
 - Grouping column — Unique values form independent groups
 - Aggregating column — Column whose values will get aggregated. Usually numeric
 - Aggregating function — How the values will get aggregated (sum, min, max, mean, median, etc…)

In [67]:
college[['stabbr', 'satmtmid', 'satvrmid', 'ugds']].head()

  stabbr  satmtmid  satvrmid     ugds
0     AL     420.0     424.0   4206.0
1     AL     565.0     570.0  11383.0
2     AL       NaN       NaN    291.0
3     AL     590.0     595.0   5451.0
4     AL     430.0     425.0   4811.0

### Several different syntaxes that return the maximum math SAT score per state:

#### Method 1

In [68]:
college.groupby('stabbr').agg({'satmtmid': 'max'}).head()

        satmtmid
stabbr
AK         503.0
AL         590.0
AR         600.0
AS           NaN
AZ         580.0

#### Method 2a: 
The aggregating column can be selected within brackets following the call to groupby. Notice that a Series is returned here and not a DataFrame.

In [69]:
college.groupby('stabbr')['satmtmid'].agg('max').head()

stabbr
AK    503.0
AL    590.0
AR    600.0
AS      NaN
AZ    580.0
Name: satmtmid, dtype: float64

#### Method 2b: 
The aggregate method is an alias for agg and can also be used. This returns the same Series as above.

In [70]:
college.groupby('stabbr')['satmtmid'].aggregate('max').head()

stabbr
AK    503.0
AL    590.0
AR    600.0
AS      NaN
AZ    580.0
Name: satmtmid, dtype: float64

#### Method 3: 
You can call the aggregating method directly without calling agg. This returns the same Series as above.

In [71]:
college.groupby('stabbr')['satmtmid'].max().head()

stabbr
AK    503.0
AL    590.0
AR    600.0
AS      NaN
AZ    580.0
Name: satmtmid, dtype: float64



The reason Method1 is preffered is that it can handle more complex grouping problems. 

For instance, if we wanted to find the max and min of the math and verbal sat scores along with the average undergrad population per state we would do the following:

In [73]:
college.groupby('stabbr').agg({'satmtmid': ['min', 'max'],'satvrmid': ['min', 'max'],'ugds': 'mean'}).round(0).head(10)

       satmtmid        satvrmid           ugds
            min    max      min    max    mean
stabbr
AK        503.0  503.0    555.0  555.0  2493.0
AL        400.0  590.0    420.0  595.0  2790.0
AR        427.0  600.0    410.0  600.0  1644.0
AS          NaN    NaN      NaN    NaN  1276.0
AZ        480.0  580.0    485.0  565.0  4130.0
CA        441.0  785.0    435.0  765.0  3518.0
CO        424.0  680.0    475.0  635.0  2325.0
CT        430.0  750.0    425.0  755.0  1874.0
DC        445.0  710.0    430.0  710.0  2645.0
DE        430.0  605.0    430.0  585.0  2491.0

In [74]:
college.groupby('stabbr').agg({'satmtmid': ['min', 'max'], 'satvrmid': ['min', 'max'], 'ugds': 'mean'}).round(0).head()

       satmtmid        satvrmid           ugds
            min    max      min    max    mean
stabbr
AK        503.0  503.0    555.0  555.0  2493.0
AL        400.0  590.0    420.0  595.0  2790.0
AR        427.0  600.0    410.0  600.0  1644.0
AS          NaN    NaN      NaN    NaN  1276.0
AZ        480.0  580.0    485.0  565.0  4130.0

**Guidance — Use `df.groupby('grouping column').agg({'aggregating column': 'aggregating function'})` as your primary syntax of choice**

### Handling a MultiIndex

Let’s create a result similar to the last groupby from above, except this time group by both state and religious affiliation.

In [75]:
agg_dict = {'satmtmid': ['min', 'max'],
                'satvrmid': ['min', 'max'],
                'ugds': 'mean'}
df = college.groupby(['stabbr', 'relaffil']).agg(agg_dict)
df.head(10).round(0)

                satmtmid        satvrmid           ugds
                     min    max      min    max    mean
stabbr relaffil
AK     0             NaN    NaN      NaN    NaN  3509.0
       1           503.0  503.0    555.0  555.0   123.0
AL     0           420.0  590.0    424.0  595.0  3249.0
       1           400.0  560.0    420.0  565.0   980.0
AR     0           427.0  565.0    410.0  555.0  1794.0
       1           495.0  600.0    425.0  600.0   918.0
AS     0             NaN    NaN      NaN    NaN  1276.0
AZ     0           503.0  580.0    535.0  565.0  4364.0
       1           480.0  480.0    485.0  485.0   693.0
CA     0           445.0  785.0    435.0  765.0  3802.0

A MultiIndex in both the index and columns

Both the rows and columns have a MultiIndex with two levels.


Selection and further processing is difficult with a MultiIndex

Convert to a single level index — Rename the columns and reset the index


We can convert this DataFrame so that only single-level indexes remain. 

There is no direct way to rename columns of a DataFrame during a groupby, so we must overwrite them manually:

In [76]:
df.columns = ['min satmtmid', 'max satmtmid', 'min satvrmid',         
                   'max satvrmid', 'mean ugds']
df.head()

                 min satmtmid  max satmtmid  min satvrmid  max satvrmid  \
stabbr relaffil
AK     0                  NaN           NaN           NaN           NaN
       1                503.0         503.0         555.0         555.0
AL     0                420.0         590.0         424.0         595.0
       1                400.0         560.0         420.0         565.0
AR     0                427.0         565.0         410.0         555.0

                   mean ugds
stabbr relaffil
AK     0         3508.857143
       1          123.333333
AL     0         3248.774648
       1          979.722222
AR     0         1793.691176

From here, we can use the reset_index method to make each index level an actual column.

In [77]:
df.reset_index().head()

,stabbr,relaffil,min satmtmid,max satmtmid,min satvrmid,max satvrmid,mean ugds
0,AK,0,NaN,NaN,NaN,NaN,3508.857143
1,AK,1,503.0,503.0,555.0,555.0,123.333333
2,AL,0,420.0,590.0,424.0,595.0,3248.774648
3,AL,1,400.0,560.0,420.0,565.0,979.722222
4,AR,0,427.0,565.0,410.0,555.0,1793.691176

**Guidance: Avoid using a MultiIndex. Flatten it after a call to groupby by renaming columns and resetting the index.**

### The similarity between groupby, pivot_table, and crosstab

#### The equivalency of groupby aggregation and pivot_table

Performing an aggregation with groupby is essentially equivalent to using the pivot_table method. Both methods return the exact same data, but in a different shape.

In [83]:
emp = pd.read_csv('intro_to_pandas/data/employee.csv')

In [84]:
emp.head()

,dept,title,hire_date,salary,sex,race
0,Police,POLICE SERGEANT,2001-12-03,87545.38,Male,White
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,Male,Hispanic
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,Male,Black
3,Police,SENIOR POLICE OFFICER,1997-05-27,75942.10,Male,Hispanic
4,Police,SENIOR POLICE OFFICER,2006-01-23,69355.26,Male,White

Let’s use a groupby to find the average salary for each department by gender.

In [87]:
emp.groupby(['dept', 'sex']).agg({'salary': 'mean'}).round(-3)

                                 salary
dept                    sex
Fire                    Female  62000.0
                        Male    60000.0
Health & Human Services Female  54000.0
                        Male    59000.0
Houston Airport System  Female  51000.0
                        Male    57000.0
Houston Public Works    Female  51000.0
                        Male    51000.0
Library                 Female  41000.0
                        Male    44000.0
Other                   Female  61000.0
                        Male    62000.0
Parks & Recreation      Female  37000.0
                        Male    37000.0
Police                  Female  58000.0
                        Male    69000.0
Solid Waste Management  Female  47000.0
                        Male    43000.0

We can duplicate this data by using a pivot_table.

In [89]:
emp.pivot_table(index='dept', columns='sex', 
                    values='salary', aggfunc='mean').round(-3)

sex                       Female     Male
dept
Fire                     62000.0  60000.0
Health & Human Services  54000.0  59000.0
Houston Airport System   51000.0  57000.0
Houston Public Works     51000.0  51000.0
Library                  41000.0  44000.0
Other                    61000.0  62000.0
Parks & Recreation       37000.0  37000.0
Police                   58000.0  69000.0
Solid Waste Management   47000.0  43000.0

Notice that the values are exactly the same. 
The only difference is that the gender column has been pivoted so its unique values are now the column names. 

The same three components of a groupby are found in a pivot_table. 
The grouping column(s) are passed to the index and columns parameters. 

The aggregating column is passed to the values parameter and the aggregating function is passed to the aggfunc parameter.

It’s actually possible to get an exact duplication of both the data and the shape by passing both grouping columns as a list to the index parameter.

In [90]:
emp.pivot_table(index=['dept', 'sex'], 
                    values='salary', aggfunc='mean').round(-3)

                                 salary
dept                    sex
Fire                    Female  62000.0
                        Male    60000.0
Health & Human Services Female  54000.0
                        Male    59000.0
Houston Airport System  Female  51000.0
                        Male    57000.0
Houston Public Works    Female  51000.0
                        Male    51000.0
Library                 Female  41000.0
                        Male    44000.0
Other                   Female  61000.0
                        Male    62000.0
Parks & Recreation      Female  37000.0
                        Male    37000.0
Police                  Female  58000.0
                        Male    69000.0
Solid Waste Management  Female  47000.0
                        Male    43000.0

Typically, pivot_table is used with two grouping columns, one as the index and the other as the columns. But, it can be used for a single grouping column. The following produces an exact duplication of a single grouping column with groupby.

In [92]:
df1 = emp.groupby('dept').agg({'salary':'mean'}).round(0)
df2 = emp.pivot_table(index='dept', values='salary', 
                          aggfunc='mean').round(0)
df1.equals(df2)

True

In [93]:
df1.head()

                          salary
dept
Fire                     60574.0
Health & Human Services  55297.0
Houston Airport System   55027.0
Houston Public Works     51434.0
Library                  42051.0

**Guidance: use `pivot_table` when comparing groups**

#### The equivalency of pivot_table and pd.crosstab

The pivot_table method and the crosstab function can both produce the exact same results with the same shape. They both share the parameters index, columns, values, and aggfunc. The major difference on the surface is that crosstab is a function and not a DataFrame method. This forces you to use columns as Series and not string names for the parameters. Let’s see an example taking the average salary by gender and race.

In [94]:
emp.pivot_table(index='sex', columns='race', 
                    values='salary', aggfunc='mean').round(-3)

race      Asian    Black  Hispanic  Native American    White
sex
Female  66000.0  52000.0   49000.0          49000.0  66000.0
Male    65000.0  52000.0   58000.0          62000.0  67000.0

The crosstab function produces the exact same result with the following syntax.

In [95]:
pd.crosstab(index=emp['sex'], columns=emp['race'], 
                values=emp['salary'], aggfunc='mean').round(-3)

race      Asian    Black  Hispanic  Native American    White
sex
Female  66000.0  52000.0   49000.0          49000.0  66000.0
Male    65000.0  52000.0   58000.0          62000.0  67000.0

**crosstab was built for counting**

A crosstabulation (also known as a contingency table) shows the frequency between two variables. 

This is the default functionality for crosstab if given two columns. 

Let’s show this by counting the frequency of all race and gender combinations. 

Notice that there is no need to provide an aggfunc.

In [97]:
pd.crosstab(index=emp['sex'], columns=emp['race'])

race    Asian  Black  Hispanic  Native American  White
sex
Female    488   3587      1940               39   1291
Male     1059   5074      4208              107   6488

The pivot_table method can duplicate this but you must use the size aggregation function.

In [99]:
emp.pivot_table(index='sex', columns='race', aggfunc='size')

race    Asian  Black  Hispanic  Native American  White
sex
Female    488   3587      1940               39   1291
Male     1059   5074      4208              107   6488

Relative frequency — the unique functionality with crosstab


At this point, it appears that the crosstab function is just a subset of pivot_table. 

But, there is a single unique functionality that it posseses that makes it potentially worthwhile to add to your minimally sufficient subset.

It has the ability to calculate relative frequencies across groups with the normalize parameter. 

For instance, if we wanted the percentage breakdown by gender across each race we can set the normalize parameter to ‘columns’.

In [102]:
pd.crosstab(index=emp['sex'], columns=emp['race'], 
                normalize='columns').round(2)

race    Asian  Black  Hispanic  Native American  White
sex
Female   0.32   0.41      0.32             0.27   0.17
Male     0.68   0.59      0.68             0.73   0.83

You also have the option of normalizing over the rows using the string ‘index’ or over the entire DataFrame with the string ‘all’ as seen below.

In [103]:
pd.crosstab(index=emp['sex'], columns=emp['race'], 
                normalize='all').round(3)

race    Asian  Black  Hispanic  Native American  White
sex
Female  0.020  0.148     0.080            0.002  0.053
Male    0.044  0.209     0.173            0.004  0.267

**Guidance: Only use crosstab when finding relative frequency**

All other situations where the crosstab function may be used can be handled with pivot_table. 

It is possible to manually calculate the relative frequencies after running pivot_table so crosstab isn’t all that necessary. 

But, it does do this calculation in a single readable line of code!

### The similarity between melt and stack


The `melt` and `stack` methods reshape data in the same exact manner. 
The major difference is that the `melt` method does not work with data in the index while `stack` does. 

Let’s begin by reading in a small dataset of arrival delay of airlines for a few airports.

In [110]:
ad = pd.read_csv('intro_to_pandas/data/flight_status.csv')

In [111]:
ad.head()

  airline   status  ATL  DEN   DFW  IAH  LAS  LAX  MSP   ORD  PHX  SFO
0      AA  Delayed   42   57   893   40   79  202   25   378  170   68
1      AA  On Time  191  162  3113  156  295  783  122  1118  709  297
2      AS  Delayed    3    4     2    1   12   23    4     7    5   23
3      AS  On Time   10   46    45    6  109  239   11    45   59  114
4      B6  Delayed    0   10     5    0   30   32    0    30    5   33

In [112]:
ad.melt(id_vars='airline', value_vars=['ATL', 'DEN', 'DFW'])

   airline variable  value
0       AA      ATL     42
1       AA      ATL    191
2       AS      ATL      3
3       AS      ATL     10
4       B6      ATL      0
..     ...      ...    ...
79      US      DFW     89
80      VX      DFW      0
81      VX      DFW      0
82      WN      DFW      0
83      WN      DFW      0

[84 rows x 3 columns]

In [113]:
ad_idx = ad.set_index('airline')

In [114]:
ad_idx.head()

          status  ATL  DEN   DFW  IAH  LAS  LAX  MSP   ORD  PHX  SFO
airline
AA       Delayed   42   57   893   40   79  202   25   378  170   68
AA       On Time  191  162  3113  156  295  783  122  1118  709  297
AS       Delayed    3    4     2    1   12   23    4     7    5   23
AS       On Time   10   46    45    6  109  239   11    45   59  114
B6       Delayed    0   10     5    0   30   32    0    30    5   33

In [115]:
ad_idx.stack()

airline
AA       status    Delayed
         ATL            42
         DEN            57
         DFW           893
         IAH            40
                    ...
WN       LAX           791
         MSP           200
         ORD             0
         PHX          1327
         SFO           337
Length: 308, dtype: object

In [116]:
ad_idx.stack().reset_index()

    airline level_1        0
0        AA  status  Delayed
1        AA     ATL       42
2        AA     DEN       57
3        AA     DFW      893
4        AA     IAH       40
..      ...     ...      ...
303      WN     LAX      791
304      WN     MSP      200
305      WN     ORD        0
306      WN     PHX     1327
307      WN     SFO      337

[308 rows x 3 columns]

Renaming columns with `melt`
With `melt`  you can rename columns directly and you can avoid dealing with a MultiIndex. 

The var_name and value_name parameters are provided to melt to rename the reshaped columns. 

It’s also unnecessary to list out all of the columns you are melting because all the columns not found in id_vars will be reshaped.

In [117]:
ad.melt(id_vars='airline', var_name='airport', 
            value_name='arrival delay')

    airline airport arrival delay
0        AA  status       Delayed
1        AA  status       On Time
2        AS  status       Delayed
3        AS  status       On Time
4        B6  status       Delayed
..      ...     ...           ...
303      US     SFO            57
304      VX     SFO            85
305      VX     SFO           395
306      WN     SFO           108
307      WN     SFO           337

[308 rows x 3 columns]

**Guidance — Use melt over stack because it allows you to rename columns and it avoids a MultiIndex**